-- MySQL dump 10.13  Distrib 5.5.24, for Win64 (x86)
--
-- Host: localhost    Database: examonline
-- ------------------------------------------------------
-- Server version	5.5.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `examonline`
--

/*!40000 DROP DATABASE IF EXISTS `examonline`*/;

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `examonline` /*!40100 DEFAULT CHARACTER SET latin1 */;

USE `examonline`;

--
-- Table structure for table `examinee`
--

DROP TABLE IF EXISTS `examinee`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `examinee` (
  `examinee_id` char(6) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL DEFAULT '',
  `examinee_status` char(1) CHARACTER SET latin1 COLLATE latin1_general_ci DEFAULT NULL COMMENT '0: not attended 1: pass 2: candidate 3: fail',
  `examinee_answers` varchar(100) CHARACTER SET latin1 COLLATE latin1_general_ci DEFAULT NULL,
  `examinee_score` int(3) DEFAULT NULL,
  `examinee_exam_paper_id` char(6) CHARACTER SET latin1 COLLATE latin1_general_ci DEFAULT NULL,
  `examinee_time` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`examinee_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `examinee`
--

LOCK TABLES `examinee` WRITE;
/*!40000 ALTER TABLE `examinee` DISABLE KEYS */;
INSERT INTO `examinee` VALUES ('A00123','9','14441',40,'0002','2013-06-05 10:00:28'),('A00124','9','13111',100,'0002','2013-06-05 12:58:13'),('A00125','9','11121',60,'0002','2013-06-05 15:04:11');
/*!40000 ALTER TABLE `examinee` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `exampaper`
--

DROP TABLE IF EXISTS `exampaper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `exampaper` (
  `exam_paper_id` int(4) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `exam_paper_ques_id_list` varchar(600) COLLATE utf8_unicode_ci DEFAULT NULL,
  `exam_paper_create_time` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`exam_paper_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `exampaper`
--

LOCK TABLES `exampaper` WRITE;
/*!40000 ALTER TABLE `exampaper` DISABLE KEYS */;
INSERT INTO `exampaper` VALUES (0001,'000001;000003;000005;','2013-06-03 11:13:06'),(0002,'000001;000002;000003;000004;000005;','2013-06-13 05:49:26'),(0003,'000001;000002;000003;000004;000005;000011;000012;000013;000014;000015;000021;000022;000023;000024;000025;000031;000032;000033;000034;000035;','2013-06-17 02:16:48');
/*!40000 ALTER TABLE `exampaper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `questionbank`
--

DROP TABLE IF EXISTS `questionbank`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `questionbank` (
  `ques_id` int(6) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `ques_body` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `ques_ans_1` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `ques_ans_2` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `ques_ans_3` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `ques_ans_4` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `ques_ans_is` char(1) CHARACTER SET latin1 NOT NULL,
  `ques_category` char(1) CHARACTER SET latin1 NOT NULL,
  `ques_status` char(1) CHARACTER SET latin1 NOT NULL COMMENT '0: normal 1: duplicated',
  `ques_in_exam_paper_id` char(4) CHARACTER SET latin1 NOT NULL,
  `ques_difficulty` char(1) CHARACTER SET latin1 NOT NULL COMMENT '0: normal 1: hard 2: very hard',
  `ques_create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`ques_id`)
) ENGINE=InnoDB AUTO_INCREMENT=113 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `questionbank`
--

LOCK TABLES `questionbank` WRITE;
/*!40000 ALTER TABLE `questionbank` DISABLE KEYS */;
INSERT INTO `questionbank` VALUES (000001,' 西餐中此刀為','牛排刀','奶油刀','魚刀','水果刀','1','9','9','9999','9','2013-06-13 06:07:36'),(000002,' 下列何者是餐後冷飲所配用的餐具','茶匙','甜點匙','冰茶匙','咖啡匙','3','9','9','9999','9','2013-06-13 05:34:36'),(000003,' 下列何者是西餐食用生蠔時，使用的餐具','牡蠣叉','沙拉叉','餐叉','魚叉','1','9','9','9999','9','2013-06-13 05:34:36'),(000004,' 中餐的味碟應排在骨盤的','右上方','左上方','右下方','左下方','1','9','9','9999','9','2013-06-13 05:34:36'),(000005,' 筷子的擺設應平直架於筷架上，標誌一般朝','上','下','內','外','1','9','9','9999','9','2013-06-13 05:34:36'),(000006,' 中餐擺設的公杯其杯嘴方向應朝向','前','後','左','右','3','9','9','9999','9','2013-06-13 05:34:36'),(000007,' 西餐中十吋的盤子是為','主餐盤','奶油麵包盤','展示盤','沙拉盤','1','9','9','9999','9','2013-06-13 05:34:36'),(000008,' 西餐餐具使用順序是','由外往內','由內往外','由中間向外','客人使用方便就行','1','9','9','9999','9','2013-06-13 05:34:36'),(000009,' 中餐廳為客人上全魚時，如以客人方向為主，應','魚頭朝左，魚腹向外','魚頭朝左，魚腹向內','魚頭朝右，魚腹向外','魚頭朝右，魚腹向內','2','9','9','9999','9','2013-06-13 05:34:36'),(000010,' 龍蝦箝應放置在餐桌客人那一邊','左方','右方','右上方','左上方','1','9','9','9999','9','2013-06-13 05:34:36'),(000011,' 龍蝦剔叉應放置在餐桌客人那一邊？','右上方','左上方','右方','左方','3','9','9','9999','9','2013-06-13 05:34:37'),(000012,' 桌卡的放置應','打開背對客人','打開斜對客人','打開面對客人','闔上平放桌上','3','9','9','9999','9','2013-06-13 05:34:37'),(000013,' 蠔叉應放置在餐桌客人那一邊','左邊','右邊','左上方','右下方','2','9','9','9999','9','2013-06-13 05:34:37'),(000014,' 龍蝦大餐中，置殼盤應放置在骨盤的','正前方','正後方','左前方','左後方','1','9','9','9999','9','2013-06-13 05:34:37'),(000015,' 中餐擺設中，小酒杯在啤酒杯的右方約','一指寬','兩指寬','三指寬','四指寬','2','9','9','9999','9','2013-06-13 05:34:37'),(000016,' 正式包廂中餐圓桌，一桌有幾個公杯','四個','六個','八個','十二個','2','9','9','9999','9','2013-06-13 05:34:37'),(000017,' 包廂中，餐的佐料壺應放在牙籤盅的','右側','右上方','左側','左上方','1','9','9','9999','9','2013-06-13 05:34:37'),(000018,' 中餐中客人是每多少人共用一個煙灰缸','二人','三人','四人','五人','1','9','9','9999','9','2013-06-13 05:34:37'),(000019,' 客人點用意大利麵，餐叉應放置在客人那一邊？','右邊','右上方','左邊','左上方','1','9','9','9999','9','2013-06-13 05:34:37'),(000020,' 下列何者餐點較容易控制食物成本？','套餐','單點','自助餐','組合餐點','1','9','9','9999','9','2013-06-13 05:34:37'),(000021,' 吃龍蝦時要附上','牛排刀','洗手盅','餐刀','牡蠣刀','2','9','9','9999','9','2013-06-13 05:34:37'),(000022,' 西餐餐刀中最不鋒利是','奶油刀','魚刀','餐刀','牛排刀','1','9','9','9999','9','2013-06-13 05:34:37'),(000023,' 餐巾在清朝稱為','懷兜','口布','席金','懷擋','4','9','9','9999','9','2013-06-13 05:34:37'),(000024,' 此種餐巾摺疊法稱為','筍帽型','蓬帳型','蠟燭型','濟公帽型','4','9','9','9999','9','2013-06-13 05:34:37'),(000025,' 此種餐巾摺疊法稱為','自助餐型','卷蛋型','長笛型','__________丹麥酥型','1','9','9','9999','9','2013-06-13 05:34:37'),(000026,' 西餐中八吋的盤子稱為','主菜餐盤','中間菜盤','點心盤','麵包盤','3','9','9','9999','9','2013-06-13 05:34:37'),(000027,' 下列何者非餐巾的別稱？','席巾','桌巾','茶巾','口布','2','9','9','9999','9','2013-06-13 05:34:37'),(000028,' 下列何者非餐巾摺疊的原則','高雅','衛生','複雜','清潔','3','9','9','9999','9','2013-06-13 05:34:37'),(000029,' 獨木舟餐巾如圖 摺好需如何放置在展示盤上？','倒立','平放','直放','橫放','3','9','9','9999','9','2013-06-13 05:34:37'),(000030,' 西式餐桌擺設，通常餐叉係擺在展示盤的那一邊？','右邊','左邊','上方','下方','2','9','9','9999','9','2013-06-13 05:34:37'),(000031,' 西餐餐具當中，有銳利鋸齒之刀具是','奶油刀','魚刀','牛排刀','水果刀','3','9','9','9999','9','2013-06-13 05:34:37'),(000032,' 中式筵席12 人桌擺設定位點，初學者用骨盤最好以何者為標的？','偶數座位','奇數座位','學資深人員用“目測＂','12.3.6.9 點鐘座位','4','9','9','9999','9','2013-06-13 05:34:37'),(000033,' 當西餐餐桌擺設時，通常湯匙係擺在下列那個位置？','餐刀右邊','餐叉右邊','展示盤上方','麵包盤上','1','9','9','9999','9','2013-06-13 05:34:37'),(000034,' 下列各式刀具中，那一種最為銳利？','沙拉刀','魚刀','牛排刀','奶油刀','3','9','9','9999','9','2013-06-13 05:34:37'),(000035,' 中式筵席所使用的大菜盤其尺寸為:','16-14 吋','12-10 吋','8-6 吋','6 吋以下','1','9','9','9999','9','2013-06-13 05:34:37'),(000036,' 西餐主菜盤的尺寸，其直徑至少應為多少吋以上？','10 吋','9 吋','8 吋','6 吋','1','9','9','9999','9','2013-06-13 05:34:37'),(000037,' 供應半粒葡萄柚給客人時，應另附下列那種餐具？','餐刀','餐叉','洗手盅','湯匙','3','9','9','9999','9','2013-06-13 05:34:37'),(000038,' 供應田螺給客人時，田螺叉應放在客人的那一邊？','右邊','左邊','上方','下方','1','9','9','9999','9','2013-06-13 05:34:37'),(000039,' 西餐餐桌擺設時，通常餐刀的刀口係朝下列那一個方向？','向左朝展示盤','向右朝外側','向上方','向下方','1','9','9','9999','9','2013-06-13 05:34:37'),(000040,' 西餐餐桌擺設時，通常以下列那項餐具作為定位用？','杯皿','刀具','湯碗','口布','4','9','9','9999','9','2013-06-13 05:34:37'),(000041,' 中餐餐桌擺設，通常以下列那種餐具先置放？','味碟','筷架','骨盤','湯碗','3','9','9','9999','9','2013-06-13 05:34:37'),(000042,' 中餐餐席菜[糖醋黃魚]通常係以下列那類餐盤來裝盛？','16 吋圓盤','16 吋橢圓盤','14 吋橢圓盤','14 吋圓盤','2','9','9','9999','9','2013-06-13 05:34:37'),(000043,' 通常中餐酒席擺設的餐位係以多少人為標準？','8 人','10 人','12 人','16 人','3','9','9','9999','9','2013-06-13 05:34:37'),(000044,' 中餐餐桌擺設，通常將餐巾置於何處？','味碟上方','筷子架右側','骨盤右側','骨盤上','4','9','9','9999','9','2013-06-13 05:34:38'),(000045,' 一般中餐餐桌擺設，味碟的位置係在骨盤的那一方？','右上方','右下方','左上方','左下方','1','9','9','9999','9','2013-06-13 05:34:38'),(000046,' 早餐餐桌擺設咖啡杯皿時，咖啡杯應置於何處？','餐叉左側','餐叉上方','餐刀右側','餐刀左側','3','9','9','9999','9','2013-06-13 05:34:38'),(000047,' 持托盤自工作檯拿取餐具時，為使托盤保持平衡，餐具放置時應先放置托盤上何處？','左邊','右邊','正中央','前方','3','9','9','9999','9','2013-06-13 05:34:38'),(000048,' 下列那一項係屬於高級餐廳餐桌服務特性？','擺展示盤','擺刀叉匙','擺餐墊紙','擺高腳杯','1','9','9','9999','9','2013-06-13 05:34:38'),(000049,' 中餐餐桌擺設時，筷子架通常應置於何處？','骨盤左方','骨盤上方','骨盤下方','骨盤右方','4','9','9','9999','9','2013-06-13 05:34:38'),(000050,' 菜單上不需具備那一種項目','價目','菜名','是否加服務費','成本','4','9','9','9999','9','2013-06-13 05:34:38'),(000051,' 下列何種不是構成菜單的要素？','顏色','質料','菜色種類','餐桌擺設','4','9','9','9999','9','2013-06-13 05:34:38'),(000052,' 美式早餐和歐式早餐的不同是在於美式早餐再加上','一道主菜','一杯咖啡','一杯酒','一份麵包','1','9','9','9999','9','2013-06-13 05:34:38'),(000053,' 不吃牛肉豬肉等肉類，此項禁忌規定係屬於下列何種宗教的餐食','摩門教','回教','印度教','猶太教','3','9','9','9999','9','2013-06-13 05:34:38'),(000054,' 魚刀並非一定要有，大眾化餐廳可以何種餐具來代替','牛排刀','點心刀','大餐刀','沙拉刀','3','9','9','9999','9','2013-06-13 05:34:38'),(000055,' 套餐菜單之特色','菜色繁多，任君選擇','價格昂貴，菜色固定','提供數量有限的菜色，價格固定','可單點餐食，給顧客更大選擇空間','3','9','9','9999','9','2013-06-13 05:34:38'),(000056,' 不吃一切肉類，甚至奶類、蛋類，以上敘述是屬於下列何種的餐食','摩門教','回教','素食者','印度教','3','9','9','9999','9','2013-06-13 05:34:38'),(000057,' 下列敘述何者錯誤','菜單設計要考慮成本與利潤','菜單內容要簡單易懂','菜單不需考慮營養成分','菜單是餐廳中重要的商品目錄','3','9','9','9999','9','2013-06-13 05:34:38'),(000058,' 「滿漢全席」興起於','宋','元','明','清 朝的一種大型筵席','4','9','9','9999','9','2013-06-13 05:34:38'),(000059,' 下列何者不是目前一般餐飲菜單必備的基本資料','價格','烹調方式','服務費','烹調者姓名','4','9','9','9999','9','2013-06-13 05:34:38'),(000060,' 菜單最好是清晰易懂，例如「魚香茄子」一菜中，A.可說明本菜使用材料是茄子；B.魚香代表其原料之一；C.魚香代表烹調方式；D.可看出其份量有多少，以上敘述何者正確','AB','AC','AD','BD','2','9','9','9999','9','2013-06-13 05:34:38'),(000061,' 安排菜單之原則，下列何者為非？','重覆的烹調方法與單一的配菜','注重菜餚本身之色香味','先出海鮮後出禽肉類','重口味後於淡口味','1','9','9','9999','9','2013-06-13 05:34:38'),(000062,' 洗手盅的主要用途係供客人','在餐前','在餐後','在吃牛排時','在吃帶殼海鮮時 的一種洗手用餐具','4','9','9','9999','9','2013-06-13 05:34:38'),(000063,' 紅酒杯容量比白酒杯','大','小','一樣','不一定','1','9','9','9999','9','2013-06-13 05:34:38'),(000064,' 用來攪拌深杯裝的冰紅茶的是','茶匙','甜點匙','冰茶匙','肉湯匙','3','9','9','9999','9','2013-06-13 05:34:38'),(000065,' 中餐擺設時，筷子均置於筷架上，擺在骨盤的','前方','右側','左側','骨盤上方','2','9','9','9999','9','2013-06-13 05:34:38'),(000066,' 沙拉叉應擺在晚餐叉的','右側','左側','上方','下方','2','9','9','9999','9','2013-06-13 05:34:38'),(000067,' 通常不會單獨使用，而是與點心匙或點心刀合用的是','點心叉','餐叉','魚叉','冰茶匙','1','9','9','9999','9','2013-06-13 05:34:38'),(000068,' 餐具中那一種不屬於金屬類','餐刀','餐叉','餐巾','餐匙','3','9','9','9999','9','2013-06-13 05:34:38'),(000069,' 當顧客提出湯匙尺寸過大不適合幼小顧客喝湯使用時，服務人員較佳的應變方法是','建議顧客繼續使用，維護西餐國際禮儀','更換尺寸較小的湯匙方便顧客使用','建議更換菜單','報告上司留待主管後續處理','2','9','9','9999','9','2013-06-13 05:34:38'),(000070,' 西餐餐具中，點心盤的直徑為','6 吋','7 吋','8 吋','9 吋','3','9','9','9999','9','2013-06-13 05:34:38'),(000071,' 中餐服務時，分菜員的位置在主人的','左方','前方','右方','以上皆可','3','9','9','9999','9','2013-06-13 05:34:38'),(000072,' 上咖啡杯時，應將咖啡杯把手至於客人之','左方向','右方向','前方向','以上皆可','2','9','9','9999','9','2013-06-13 05:34:38'),(000073,' 餐具擺設時','無一定規矩','有一定規矩','隨客人喜好','隨服務人員喜好','2','9','9','9999','9','2013-06-13 05:34:38'),(000074,' 餐具中點心盤尺寸比麵包盤為','大','小','一樣','任何尺寸都可以','1','9','9','9999','9','2013-06-13 05:34:38'),(000075,' 紅酒杯應擺在白酒杯之','左上方','右上方','正上方','正下方','1','9','9','9999','9','2013-06-13 05:34:38'),(000076,' 水杯應擺在紅酒杯的','正上方','正下方','左上方','右上方','3','9','9','9999','9','2013-06-13 05:34:38'),(000077,' 西餐餐桌擺設時，奶油刀通常應置於','餐盤上','與其他刀並列','與其他叉並列','麵包盤上','4','9','9','9999','9','2013-06-13 05:34:38'),(000078,' 西式餐桌擺設，通常餐刀擺在展示盤的那一邊','左邊','右邊','上方','下方','2','9','9','9999','9','2013-06-13 05:34:38'),(000079,' 通常中餐供食魚類佳餚用的盤子是','圓形盤','方形盤','橢圓形盤','三角形盤','3','9','9','9999','9','2013-06-13 05:34:38'),(000080,' 對於展示盤的敘述何者錯誤？','英文是Service Plate／Show Plate','直徑約30~32 公分','西式餐桌擺設時用來定位','正式上菜時用來盛裝主菜','4','9','9','9999','9','2013-06-13 05:34:38'),(000081,' 對於圓盤（B. B. Plate）的敘述何者錯誤？','英文是Bread and Beverage Plate／Side Plate','直徑約16~18 公分','西式餐桌擺設時放在客人左側','盛裝麵包用又稱為麵包盤','1','9','9','9999','9','2013-06-13 05:34:39'),(000082,' 胡椒研磨棒的英文是','Pepper Bowl','Pepper Mill','Pepper Holder','Pepper Stand','2','9','9','9999','9','2013-06-13 05:34:39'),(000083,' 檯心布又稱','檯布','口布','頂檯布','墊布','3','9','9','9999','9','2013-06-13 05:34:39'),(000084,' 服務巾又稱','臂巾','桌巾','口布','檯布','1','9','9','9999','9','2013-06-13 05:34:39'),(000085,' 餐桌襯墊是用來固定在桌面底，以減輕磨損、降低聲音、防止振動，英文是','Top Cloth','Service Cloth','Table Skirt','Silent Pad','4','9','9','9999','9','2013-06-13 05:34:39'),(000086,' 擦拭玻璃杯時，需對著光源看，是為了','檢查杯子是否乾淨','使杯子水份快速散去','展示杯子的造型','多此一舉','1','9','9','9999','9','2013-06-13 05:34:39'),(000087,' 服務人員在端送熱食時所用的布巾是','口布','桌巾','服務巾','廚房用布巾','3','9','9','9999','9','2013-06-13 05:34:39'),(000088,' 甲：沙拉盤；乙：展示盤；丙：麵包盤；丁：主菜盤，依大小順序排列為','甲＞乙＞丙＞丁','乙＞甲＞丙＞丁','乙＞丁＞甲＞丙','丙＞甲＞乙＞丁','3','9','9','9999','9','2013-06-13 05:34:39'),(000089,' 甲：餐刀；乙：咖啡杯；丙：點心叉；丁：湯杯，哪些餐具是屬於扁平餐具？','甲、乙','甲、丙','丙、丁','乙、丁','2','9','9','9999','9','2013-06-13 05:34:39'),(000090,' 甲：大蓮花；乙：餐具袋；丙：濟公帽；丁：步步高升，以口布的功能而言，哪些是屬於顧客用的','甲、乙','丙、丁','甲、丙','乙、丁','2','9','9','9999','9','2013-06-13 07:58:40'),(000091,' 在高級的西餐中被作為裝飾而不真正用來裝盛菜餚的餐盤是','麵包盤','沙拉盤','主餐盤','展示盤','4','9','9','9999','9','2013-06-13 05:34:39'),(000092,' 在餐桌擺設時，下列何者並不適用於定位的是','味碟','口布','骨盤','展示盤','1','9','9','9999','9','2013-06-13 05:34:39'),(000093,' 下列哪一種杯子的容量最小?','白蘭地杯','水杯','香甜酒杯','白酒杯','3','9','9','9999','9','2013-06-13 05:34:39'),(000094,' 餐桌擺設中的各式杯子按順序，由左上至右下應為：','白酒杯、紅酒杯、水杯、香檳杯','紅酒杯、水杯、白酒杯、香檳杯','水杯、紅酒杯、白酒杯、香檳杯','水杯、白酒杯、紅酒杯、香檳杯','3','9','9','9999','9','2013-06-13 05:34:39'),(000095,' 下列何者為平底酒杯','可林杯','香檳杯','雞尾酒杯','白蘭地杯','1','9','9','9999','9','2013-06-13 05:34:39'),(000096,' 餐廳內最常使用方桌尺寸為90×90 公分，宜使用何種尺寸的檯布','150×150 公分','110×110 公分','100×100 公分','90×90 公分','1','9','9','9999','9','2013-06-13 05:34:39'),(000097,' 若要舖設直徑150 公分大圓桌，宜使用何種尺寸之檯布','250×250 公分','210×210 公分','200×200 公分','190×190 公分','2','9','9','9999','9','2013-06-13 05:34:39'),(000098,' 一般餐桌桌面的高度大多為','55 公分','75 公分','95 公分','115 公分','2','9','9','9999','9','2013-06-13 05:34:39'),(000099,' 一般椅子椅面高度大多為','35 公分','55 公分','45 公分','65 公分','3','9','9','9999','9','2013-06-13 05:34:39'),(000100,' 餐桌桌面與椅面間的距離以多少為宜?','10','20','30','40 公分','3','9','9','9999','9','2013-06-13 05:34:39'),(000101,' 檯布的最佳垂下長度為','30 公分','40 公分','50 公分','60 公分','1','9','9','9999','9','2013-06-13 05:34:39'),(000102,' 食用鮮蠔時無需準備那一樣？','餐刀','蠔叉','麵包盤','洗手盅','1','9','9','9999','9','2013-06-13 05:34:39'),(000103,' 下列是西式餐桌擺設的步驟，請選出排序正確的選項：甲：擺放口布或展示盤. 乙：擺放餐刀與餐叉. 丙：擺放杯子. ','乙→甲→丙','甲→乙→丙','丙→乙→甲','乙→丙→甲','2','9','9','9999','9','2013-06-13 05:34:39'),(000104,' 客人若點用帶殼龍蝦(Lobster)這道菜則需附上何種餐具？','魚刀、魚叉','沙拉刀、沙拉叉','龍蝦鉗、龍蝦叉','牛排刀、牛排叉','3','9','9','9999','9','2013-06-13 05:34:39'),(000105,' 「開胃菜、湯、魚、點心」若依照餐桌擺設原則右側需擺放何種餐具？','沙拉刀、湯匙、魚刀','沙拉刀、魚刀、湯匙、點心匙','魚刀、湯匙、沙拉刀','魚刀、湯匙、沙拉刀、點心匙','3','9','9','9999','9','2013-06-13 05:34:39'),(000106,' 中餐餐具在桌菜時，通常每隔幾道菜更換骨盤','2－3 道','4－5 道','5－6 道','6－7 道','1','9','9','9999','9','2013-06-13 05:34:39'),(000107,' 擺設餐刀時，刀刃應朝','上','下','左','右','3','9','9','9999','9','2013-06-13 05:34:39'),(000108,' 餐具的擺設工作應由誰負責？','餐務部門人員','廚房工作人員','餐廳服務人員','房務部門人員','3','9','9','9999','9','2013-06-13 05:34:39'),(000109,' 餐盤正面印有商標者，則商標應對齊於幾點鐘的位置？','12','3','6','9 點鐘','1','9','9','9999','9','2013-06-13 05:34:39'),(000110,' 在中餐餐具擺設中，下列哪類餐具不會事先擺在餐桌上？','飯碗','口湯碗','味碟','骨盤','1','9','9','9999','9','2013-06-13 05:34:39'),(000111,' 下列何者不屬於服務檯(Service station)必備的物品？','服務巾','保溫鍋','餐刀、餐叉','點心叉、匙','2','9','9','9999','9','2013-06-13 05:34:39'),(000112,'qq','qq','qqq','qq','q','1','9','9','9999','9','2013-06-13 06:12:09');
/*!40000 ALTER TABLE `questionbank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `student` (
  `stud_id` char(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `stud_name` varchar(20) DEFAULT NULL,
  `stud_gender` char(1) DEFAULT NULL,
  `stud_birthday` char(12) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `stud_address` varchar(30) DEFAULT NULL,
  `stud_phone_num` varchar(15) DEFAULT NULL,
  `stud_examinee_id` char(6) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `stud_apply_time` varchar(120) DEFAULT NULL,
  PRIMARY KEY (`stud_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('A123456789','張小明','男','1960年1月1日','台北市忠孝東路四段168號12樓','0937123666','A00123','2013-06-13 15:16:08'),('B245687343','王國基','女','1974年6月1日','台中市忠孝路1段1號12樓','0937123777','A00123','2013-06-11 20:20:57'),('C159417867','鍾愛明','男','1987年11月5日','基隆市大橋路168號4樓','0937123777','A00123','2013-06-11 20:25:44'),('D289196570','汪立譽','女','1960年8月1日','台南市忠孝東路四段168號12樓','0937323666','A00123','2013-06-12 16:54:00'),('V178176976','林木森','男','1973年1月1日','台東市復興路67號1樓','0937123456','A00123','2013-06-11 20:19:45');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2013-06-17 13:21:04
